---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.ElementId
source: html/f79cdfec-43ce-18ca-91bd-bfbb9fbbeec7.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.ElementId Property

The element id where this analytical segment belongs.

## Syntax (C#)
```csharp
public ElementId ElementId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null